#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`
<details><summary>Show Plan</summary>
<pre>terraform
module.thadmin_routing.module.acm.aws_acm_certificate.this: Refreshing state... [id=arn:aws:acm:us-east-1:627002765486:certificate/565d3a00-d047-48f2-956a-aed08dd6956b]
module.thadmin_routing.module.cloudfront.aws_cloudfront_origin_access_identity.this["s3_bucket"]: Refreshing state... [id=E3JOC36ODMBL65]
module.thadmin_hosting.aws_s3_bucket.this: Refreshing state... [id=thalia-thadmin-staging]
module.thadmin_routing.module.acm.aws_route53_record.validation["thadmin-staging.technicie.nl"]: Refreshing state... [id=Z3I4ZHBBD5NSHU__f4c1968cf0da5157d0f46ed63ecf426e.thadmin-staging.technicie.nl._CNAME]
module.thadmin_routing.module.acm.aws_acm_certificate_validation.this: Refreshing state... [id=2022-03-15 04:55:50.004 +0000 UTC]
module.thadmin_hosting.aws_s3_bucket_acl.this: Refreshing state... [id=thalia-thadmin-staging,private]
module.thadmin_hosting.aws_s3_bucket_cors_configuration.this: Refreshing state... [id=thalia-thadmin-staging]
module.thadmin_routing.aws_s3_bucket_policy.bucket_policy: Refreshing state... [id=thalia-thadmin-staging]
module.thadmin_routing.module.cloudfront.aws_cloudfront_distribution.this[0]: Refreshing state... [id=E2ZP8HCBLISQFN]
module.thadmin_routing.aws_route53_record.api: Refreshing state... [id=Z3I4ZHBBD5NSHU_thadmin-staging_A]
module.thadmin_hosting.aws_s3_object.code_build_object["apple-splash-1170-2532.jpg"]: Refreshing state... [id=apple-splash-1170-2532.jpg]
module.thadmin_hosting.aws_s3_object.code_build_object["apple-splash-2388-1668.jpg"]: Refreshing state... [id=apple-splash-2388-1668.jpg]
module.thadmin_hosting.aws_s3_object.code_build_object["safari-pinned-tab.svg"]: Refreshing state... [id=safari-pinned-tab.svg]
module.thadmin_hosting.aws_s3_object.code_build_object["apple-splash-2778-1284.jpg"]: Refreshing state... [id=apple-splash-2778-1284.jpg]
module.thadmin_hosting.aws_s3_object.code_build_object["apple-splash-2048-1536.jpg"]: Refreshing state... [id=apple-splash-2048-1536.jpg]
module.thadmin_hosting.aws_s3_object.code_build_object["js/chunk-vendors-legacy.295f96ab.js.map"]: Refreshing state... [id=js/chunk-vendors-legacy.295f96ab.js.map]
module.thadmin_hosting.aws_s3_object.code_build_object["mstile-70x70.png"]: Refreshing state... [id=mstile-70x70.png]
module.thadmin_hosting.aws_s3_object.code_build_object["android-chrome-192x192.png"]: Refreshing state... [id=android-chrome-192x192.png]
module.thadmin_hosting.aws_s3_object.code_build_object["apple-splash-1284-2778.jpg"]: Refreshing state... [id=apple-splash-1284-2778.jpg]
module.thadmin_hosting.aws_s3_object.code_build_object["apple-splash-640-1136.jpg"]: Refreshing state... [id=apple-splash-640-1136.jpg]
module.thadmin_hosting.aws_s3_object.code_build_object["mstile-150x150.png"]: Refreshing state... [id=mstile-150x150.png]
module.thadmin_hosting.aws_s3_object.code_build_object["apple-splash-2208-1242.jpg"]: Refreshing state... [id=apple-splash-2208-1242.jpg]
module.thadmin_hosting.aws_s3_object.code_build_object["js/app-legacy.4be4e36d.js"]: Refreshing state... [id=js/app-legacy.4be4e36d.js]
module.thadmin_hosting.aws_s3_object.code_build_object["mstile-144x144.png"]: Refreshing state... [id=mstile-144x144.png]
module.thadmin_hosting.aws_s3_object.code_build_object["apple-splash-1334-750.jpg"]: Refreshing state... [id=apple-splash-1334-750.jpg]
module.thadmin_hosting.aws_s3_object.code_build_object["apple-splash-1536-2048.jpg"]: Refreshing state... [id=apple-splash-1536-2048.jpg]
module.thadmin_hosting.aws_s3_object.code_build_object["favicon-32x32.png"]: Refreshing state... [id=favicon-32x32.png]
module.thadmin_hosting.aws_s3_object.code_build_object["js/app.3062c1d3.js.map"]: Refreshing state... [id=js/app.3062c1d3.js.map]
module.thadmin_hosting.aws_s3_object.code_build_object["apple-splash-2224-1668.jpg"]: Refreshing state... [id=apple-splash-2224-1668.jpg]
module.thadmin_hosting.aws_s3_object.code_build_object["apple-splash-1792-828.jpg"]: Refreshing state... [id=apple-splash-1792-828.jpg]
module.thadmin_hosting.aws_s3_object.code_build_object["css/app.42c9e53b.css"]: Refreshing state... [id=css/app.42c9e53b.css]
module.thadmin_hosting.aws_s3_object.code_build_object["img/anonymousUser.c7a94bce.jpg"]: Refreshing state... [id=img/anonymousUser.c7a94bce.jpg]
module.thadmin_hosting.aws_s3_object.code_build_object["site.webmanifest"]: Refreshing state... [id=site.webmanifest]
module.thadmin_hosting.aws_s3_object.code_build_object["mstile-310x150.png"]: Refreshing state... [id=mstile-310x150.png]
module.thadmin_hosting.aws_s3_object.code_build_object["favicon.ico"]: Refreshing state... [id=favicon.ico]
module.thadmin_hosting.aws_s3_object.code_build_object["apple-splash-828-1792.jpg"]: Refreshing state... [id=apple-splash-828-1792.jpg]
module.thadmin_hosting.aws_s3_object.code_build_object["apple-splash-1136-640.jpg"]: Refreshing state... [id=apple-splash-1136-640.jpg]
module.thadmin_hosting.aws_s3_object.code_build_object["js/chunk-vendors.0392b1da.js.map"]: Refreshing state... [id=js/chunk-vendors.0392b1da.js.map]
module.thadmin_hosting.aws_s3_object.code_build_object["browserconfig.xml"]: Refreshing state... [id=browserconfig.xml]
module.thadmin_hosting.aws_s3_object.code_build_object["apple-splash-2688-1242.jpg"]: Refreshing state... [id=apple-splash-2688-1242.jpg]
module.thadmin_hosting.aws_s3_object.code_build_object["js/app.3062c1d3.js"]: Refreshing state... [id=js/app.3062c1d3.js]
module.thadmin_hosting.aws_s3_object.code_build_object["apple-splash-1620-2160.jpg"]: Refreshing state... [id=apple-splash-1620-2160.jpg]
module.thadmin_hosting.aws_s3_object.code_build_object["js/973-legacy.0b1df765.js.map"]: Refreshing state... [id=js/973-legacy.0b1df765.js.map]
module.thadmin_hosting.aws_s3_object.code_build_object["apple-splash-1125-2436.jpg"]: Refreshing state... [id=apple-splash-1125-2436.jpg]
module.thadmin_hosting.aws_s3_object.code_build_object["apple-splash-2436-1125.jpg"]: Refreshing state... [id=apple-splash-2436-1125.jpg]
module.thadmin_hosting.aws_s3_object.code_build_object["css/chunk-vendors.0833f3cd.css"]: Refreshing state... [id=css/chunk-vendors.0833f3cd.css]
module.thadmin_hosting.aws_s3_object.code_build_object["index.html"]: Refreshing state... [id=index.html]
module.thadmin_hosting.aws_s3_object.code_build_object["android-chrome-512x512.png"]: Refreshing state... [id=android-chrome-512x512.png]
module.thadmin_hosting.aws_s3_object.code_build_object["apple-splash-1242-2688.jpg"]: Refreshing state... [id=apple-splash-1242-2688.jpg]
module.thadmin_hosting.aws_s3_object.code_build_object["img/backgroundImage.24f22a44.jpg"]: Refreshing state... [id=img/backgroundImage.24f22a44.jpg]
module.thadmin_hosting.aws_s3_object.code_build_object["apple-splash-1668-2224.jpg"]: Refreshing state... [id=apple-splash-1668-2224.jpg]
module.thadmin_hosting.aws_s3_object.code_build_object["apple-splash-1668-2388.jpg"]: Refreshing state... [id=apple-splash-1668-2388.jpg]
module.thadmin_hosting.aws_s3_object.code_build_object["js/app-legacy.4be4e36d.js.map"]: Refreshing state... [id=js/app-legacy.4be4e36d.js.map]
module.thadmin_hosting.aws_s3_object.code_build_object["apple-splash-2532-1170.jpg"]: Refreshing state... [id=apple-splash-2532-1170.jpg]
module.thadmin_hosting.aws_s3_object.code_build_object["js/973-legacy.0b1df765.js"]: Refreshing state... [id=js/973-legacy.0b1df765.js]
module.thadmin_hosting.aws_s3_object.code_build_object["apple-splash-2732-2048.jpg"]: Refreshing state... [id=apple-splash-2732-2048.jpg]
module.thadmin_hosting.aws_s3_object.code_build_object["apple-touch-icon.png"]: Refreshing state... [id=apple-touch-icon.png]
module.thadmin_hosting.aws_s3_object.code_build_object["js/chunk-vendors-legacy.295f96ab.js"]: Refreshing state... [id=js/chunk-vendors-legacy.295f96ab.js]
module.thadmin_hosting.aws_s3_object.code_build_object["apple-splash-2048-2732.jpg"]: Refreshing state... [id=apple-splash-2048-2732.jpg]
module.thadmin_hosting.aws_s3_object.code_build_object["favicon.svg"]: Refreshing state... [id=favicon.svg]
module.thadmin_hosting.aws_s3_object.code_build_object["js/973.fbd24170.js"]: Refreshing state... [id=js/973.fbd24170.js]
module.thadmin_hosting.aws_s3_object.code_build_object["js/chunk-vendors.0392b1da.js"]: Refreshing state... [id=js/chunk-vendors.0392b1da.js]
module.thadmin_hosting.aws_s3_object.code_build_object["apple-splash-1242-2208.jpg"]: Refreshing state... [id=apple-splash-1242-2208.jpg]
module.thadmin_hosting.aws_s3_object.code_build_object["favicon-16x16.png"]: Refreshing state... [id=favicon-16x16.png]
module.thadmin_hosting.aws_s3_object.code_build_object["apple-splash-750-1334.jpg"]: Refreshing state... [id=apple-splash-750-1334.jpg]
module.thadmin_hosting.aws_s3_object.code_build_object["apple-splash-2160-1620.jpg"]: Refreshing state... [id=apple-splash-2160-1620.jpg]
module.thadmin_hosting.aws_s3_object.code_build_object["js/973.fbd24170.js.map"]: Refreshing state... [id=js/973.fbd24170.js.map]
module.thadmin_hosting.aws_s3_object.code_build_object["mstile-310x310.png"]: Refreshing state... [id=mstile-310x310.png]
module.thadmin_hosting.aws_s3_object.code_build_object["favicon.png"]: Refreshing state... [id=favicon.png]

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
  - destroy

Terraform will perform the following actions:

  # module.thadmin_hosting.aws_s3_object.code_build_object["img/backgroundImage.24f22a44.jpg"] will be updated in-place
  ~ resource "aws_s3_object" "code_build_object" {
      ~ etag               = "407e69540c950ce3e893be2cbadd0f30-2" -> "5f59aad8b5eddf226c7e5a21939e4018"
        id                 = "img/backgroundImage.24f22a44.jpg"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.thadmin_hosting.aws_s3_object.code_build_object["index.html"] will be updated in-place
  ~ resource "aws_s3_object" "code_build_object" {
      ~ etag               = "6c38fc24a37954d5e7d2d54a1ff66c46" -> "68e087f0c3ab8cbd57833c151197d1c6"
        id                 = "index.html"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.thadmin_hosting.aws_s3_object.code_build_object["js/app-legacy.4be4e36d.js"] will be destroyed
  - resource "aws_s3_object" "code_build_object" {
      - acl                = "private" -> null
      - bucket             = "thalia-thadmin-staging" -> null
      - bucket_key_enabled = false -> null
      - content_type       = "text/javascript" -> null
      - etag               = "74affb6b37c8d05ed3db5474086c58de" -> null
      - force_destroy      = false -> null
      - id                 = "js/app-legacy.4be4e36d.js" -> null
      - key                = "js/app-legacy.4be4e36d.js" -> null
      - metadata           = {} -> null
      - source             = "/home/runner/work/thadmin/thadmin/infra/modules/hosting/../../..//dist/js/app-legacy.4be4e36d.js" -> null
      - storage_class      = "STANDARD" -> null
      - tags               = {} -> null
      - tags_all           = {} -> null
    }

  # module.thadmin_hosting.aws_s3_object.code_build_object["js/app-legacy.4be4e36d.js.map"] will be destroyed
  - resource "aws_s3_object" "code_build_object" {
      - acl                = "private" -> null
      - bucket             = "thalia-thadmin-staging" -> null
      - bucket_key_enabled = false -> null
      - content_type       = "application/octet-stream" -> null
      - etag               = "825ec413a2c00593e35b333b4a18286b" -> null
      - force_destroy      = false -> null
      - id                 = "js/app-legacy.4be4e36d.js.map" -> null
      - key                = "js/app-legacy.4be4e36d.js.map" -> null
      - metadata           = {} -> null
      - source             = "/home/runner/work/thadmin/thadmin/infra/modules/hosting/../../..//dist/js/app-legacy.4be4e36d.js.map" -> null
      - storage_class      = "STANDARD" -> null
      - tags               = {} -> null
      - tags_all           = {} -> null
    }

  # module.thadmin_hosting.aws_s3_object.code_build_object["js/app-legacy.e1077caa.js"] will be created
  + resource "aws_s3_object" "code_build_object" {
      + acl                    = "private"
      + bucket                 = "thalia-thadmin-staging"
      + bucket_key_enabled     = (known after apply)
      + content_type           = "text/javascript"
      + etag                   = "e1367dba84d00906d97d953cb0f897a3"
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "js/app-legacy.e1077caa.js"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "/home/runner/work/thadmin/thadmin/infra/modules/hosting/../../..//dist/js/app-legacy.e1077caa.js"
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

  # module.thadmin_hosting.aws_s3_object.code_build_object["js/app-legacy.e1077caa.js.map"] will be created
  + resource "aws_s3_object" "code_build_object" {
      + acl                    = "private"
      + bucket                 = "thalia-thadmin-staging"
      + bucket_key_enabled     = (known after apply)
      + content_type           = "application/octet-stream"
      + etag                   = "bcffb2405f707b1b52adbb33440ba18b"
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "js/app-legacy.e1077caa.js.map"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "/home/runner/work/thadmin/thadmin/infra/modules/hosting/../../..//dist/js/app-legacy.e1077caa.js.map"
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

  # module.thadmin_hosting.aws_s3_object.code_build_object["js/app.3062c1d3.js"] will be destroyed
  - resource "aws_s3_object" "code_build_object" {
      - acl                = "private" -> null
      - bucket             = "thalia-thadmin-staging" -> null
      - bucket_key_enabled = false -> null
      - content_type       = "text/javascript" -> null
      - etag               = "e8305200e4a2e9ece4a4a351eebb3eb2" -> null
      - force_destroy      = false -> null
      - id                 = "js/app.3062c1d3.js" -> null
      - key                = "js/app.3062c1d3.js" -> null
      - metadata           = {} -> null
      - source             = "/home/runner/work/thadmin/thadmin/infra/modules/hosting/../../..//dist/js/app.3062c1d3.js" -> null
      - storage_class      = "STANDARD" -> null
      - tags               = {} -> null
      - tags_all           = {} -> null
    }

  # module.thadmin_hosting.aws_s3_object.code_build_object["js/app.3062c1d3.js.map"] will be destroyed
  - resource "aws_s3_object" "code_build_object" {
      - acl                = "private" -> null
      - bucket             = "thalia-thadmin-staging" -> null
      - bucket_key_enabled = false -> null
      - content_type       = "application/octet-stream" -> null
      - etag               = "fdb0d8d25c19eadec4c9c40f97e0f33e" -> null
      - force_destroy      = false -> null
      - id                 = "js/app.3062c1d3.js.map" -> null
      - key                = "js/app.3062c1d3.js.map" -> null
      - metadata           = {} -> null
      - source             = "/home/runner/work/thadmin/thadmin/infra/modules/hosting/../../..//dist/js/app.3062c1d3.js.map" -> null
      - storage_class      = "STANDARD" -> null
      - tags               = {} -> null
      - tags_all           = {} -> null
    }

  # module.thadmin_hosting.aws_s3_object.code_build_object["js/app.46ce9257.js"] will be created
  + resource "aws_s3_object" "code_build_object" {
      + acl                    = "private"
      + bucket                 = "thalia-thadmin-staging"
      + bucket_key_enabled     = (known after apply)
      + content_type           = "text/javascript"
      + etag                   = "253c571c5a2300c39671f35c2c2ae811"
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "js/app.46ce9257.js"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "/home/runner/work/thadmin/thadmin/infra/modules/hosting/../../..//dist/js/app.46ce9257.js"
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

  # module.thadmin_hosting.aws_s3_object.code_build_object["js/app.46ce9257.js.map"] will be created
  + resource "aws_s3_object" "code_build_object" {
      + acl                    = "private"
      + bucket                 = "thalia-thadmin-staging"
      + bucket_key_enabled     = (known after apply)
      + content_type           = "application/octet-stream"
      + etag                   = "217757c92de12b9e0468e1db7e38037b"
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "js/app.46ce9257.js.map"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "/home/runner/work/thadmin/thadmin/infra/modules/hosting/../../..//dist/js/app.46ce9257.js.map"
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

  # module.thadmin_hosting.aws_s3_object.code_build_object["js/chunk-vendors-legacy.295f96ab.js"] will be destroyed
  - resource "aws_s3_object" "code_build_object" {
      - acl                = "private" -> null
      - bucket             = "thalia-thadmin-staging" -> null
      - bucket_key_enabled = false -> null
      - content_type       = "text/javascript" -> null
      - etag               = "94357343551a5ba3c736c35d8bd0a0bd" -> null
      - force_destroy      = false -> null
      - id                 = "js/chunk-vendors-legacy.295f96ab.js" -> null
      - key                = "js/chunk-vendors-legacy.295f96ab.js" -> null
      - metadata           = {} -> null
      - source             = "/home/runner/work/thadmin/thadmin/infra/modules/hosting/../../..//dist/js/chunk-vendors-legacy.295f96ab.js" -> null
      - storage_class      = "STANDARD" -> null
      - tags               = {} -> null
      - tags_all           = {} -> null
    }

  # module.thadmin_hosting.aws_s3_object.code_build_object["js/chunk-vendors-legacy.295f96ab.js.map"] will be destroyed
  - resource "aws_s3_object" "code_build_object" {
      - acl                = "private" -> null
      - bucket             = "thalia-thadmin-staging" -> null
      - bucket_key_enabled = false -> null
      - content_type       = "application/octet-stream" -> null
      - etag               = "3d9f108bca091bc2fc898195a168af4c" -> null
      - force_destroy      = false -> null
      - id                 = "js/chunk-vendors-legacy.295f96ab.js.map" -> null
      - key                = "js/chunk-vendors-legacy.295f96ab.js.map" -> null
      - metadata           = {} -> null
      - source             = "/home/runner/work/thadmin/thadmin/infra/modules/hosting/../../..//dist/js/chunk-vendors-legacy.295f96ab.js.map" -> null
      - storage_class      = "STANDARD" -> null
      - tags               = {} -> null
      - tags_all           = {} -> null
    }

  # module.thadmin_hosting.aws_s3_object.code_build_object["js/chunk-vendors-legacy.e08bb076.js"] will be created
  + resource "aws_s3_object" "code_build_object" {
      + acl                    = "private"
      + bucket                 = "thalia-thadmin-staging"
      + bucket_key_enabled     = (known after apply)
      + content_type           = "text/javascript"
      + etag                   = "b7a3cb2ce537ff635eeba262f64cef95"
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "js/chunk-vendors-legacy.e08bb076.js"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "/home/runner/work/thadmin/thadmin/infra/modules/hosting/../../..//dist/js/chunk-vendors-legacy.e08bb076.js"
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

  # module.thadmin_hosting.aws_s3_object.code_build_object["js/chunk-vendors-legacy.e08bb076.js.map"] will be created
  + resource "aws_s3_object" "code_build_object" {
      + acl                    = "private"
      + bucket                 = "thalia-thadmin-staging"
      + bucket_key_enabled     = (known after apply)
      + content_type           = "application/octet-stream"
      + etag                   = "d9e6e3c1930f8a9ea3683152a2e82004"
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "js/chunk-vendors-legacy.e08bb076.js.map"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "/home/runner/work/thadmin/thadmin/infra/modules/hosting/../../..//dist/js/chunk-vendors-legacy.e08bb076.js.map"
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

  # module.thadmin_hosting.aws_s3_object.code_build_object["js/chunk-vendors.0392b1da.js"] will be destroyed
  - resource "aws_s3_object" "code_build_object" {
      - acl                = "private" -> null
      - bucket             = "thalia-thadmin-staging" -> null
      - bucket_key_enabled = false -> null
      - content_type       = "text/javascript" -> null
      - etag               = "3f9e7b32156a1b01ec9878c64fda9b02" -> null
      - force_destroy      = false -> null
      - id                 = "js/chunk-vendors.0392b1da.js" -> null
      - key                = "js/chunk-vendors.0392b1da.js" -> null
      - metadata           = {} -> null
      - source             = "/home/runner/work/thadmin/thadmin/infra/modules/hosting/../../..//dist/js/chunk-vendors.0392b1da.js" -> null
      - storage_class      = "STANDARD" -> null
      - tags               = {} -> null
      - tags_all           = {} -> null
    }

  # module.thadmin_hosting.aws_s3_object.code_build_object["js/chunk-vendors.0392b1da.js.map"] will be destroyed
  - resource "aws_s3_object" "code_build_object" {
      - acl                = "private" -> null
      - bucket             = "thalia-thadmin-staging" -> null
      - bucket_key_enabled = false -> null
      - content_type       = "application/octet-stream" -> null
      - etag               = "fd2cd8ddd84eeba8b7defb52f3a0de24" -> null
      - force_destroy      = false -> null
      - id                 = "js/chunk-vendors.0392b1da.js.map" -> null
      - key                = "js/chunk-vendors.0392b1da.js.map" -> null
      - metadata           = {} -> null
      - source             = "/home/runner/work/thadmin/thadmin/infra/modules/hosting/../../..//dist/js/chunk-vendors.0392b1da.js.map" -> null
      - storage_class      = "STANDARD" -> null
      - tags               = {} -> null
      - tags_all           = {} -> null
    }

  # module.thadmin_hosting.aws_s3_object.code_build_object["js/chunk-vendors.c0c16a12.js"] will be created
  + resource "aws_s3_object" "code_build_object" {
      + acl                    = "private"
      + bucket                 = "thalia-thadmin-staging"
      + bucket_key_enabled     = (known after apply)
      + content_type           = "text/javascript"
      + etag                   = "775086686326f7685ddcfdc986311c92"
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "js/chunk-vendors.c0c16a12.js"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "/home/runner/work/thadmin/thadmin/infra/modules/hosting/../../..//dist/js/chunk-vendors.c0c16a12.js"
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

  # module.thadmin_hosting.aws_s3_object.code_build_object["js/chunk-vendors.c0c16a12.js.map"] will be created
  + resource "aws_s3_object" "code_build_object" {
      + acl                    = "private"
      + bucket                 = "thalia-thadmin-staging"
      + bucket_key_enabled     = (known after apply)
      + content_type           = "application/octet-stream"
      + etag                   = "de05211f4b9df202016bee501e594717"
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "js/chunk-vendors.c0c16a12.js.map"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "/home/runner/work/thadmin/thadmin/infra/modules/hosting/../../..//dist/js/chunk-vendors.c0c16a12.js.map"
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

Plan: 8 to add, 2 to change, 8 to destroy.

Warning: Value for undeclared variable

The root module does not declare a variable named "aws_profile" but a value
was found in file "terraform.tfvars". To use this value, add a "variable"
block to the configuration.

Using a variables file to set an undeclared variable is deprecated and will
become an error in a future release. If you wish to provide certain "global"
settings to all configurations in your organization, use TF_VAR_...
environment variables to set these instead.


------------------------------------------------------------------------

Note: You didn't specify an "-out" parameter to save this plan, so Terraform
can't guarantee that exactly these actions will be performed if
"terraform apply" is subsequently run.

</pre>
</details>